---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.NumberOfServers
source: html/e78d2848-05b8-2d85-82c8-6f3450ff2c46.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.NumberOfServers Property

Indicates the number of servers currently registered with the service.

## Syntax (C#)
```csharp
public int NumberOfServers { get; }
```

## Remarks
This is the muber of all registered servers, not just of the ones that are currently active.